; domain
(define (domain gripper-strips)
	(:requirements :strips)
	(:types )
	(:constants )
	(:predicates
		(split )
		(unsplit )
		(g0_done___ )
		(g1_done___ )
		(g0_room ?r)
		(g1_room ?r)
		(g0_ball ?b)
		(g1_ball ?b)
		(g0_gripper ?g)
		(g1_gripper ?g)
		(g0_at-robby ?r)
		(g1_at-robby ?r)
		(g0_at ?b ?r)
		(g1_at ?b ?r)
		(g0_free ?g)
		(g1_free ?g)
		(g0_carry ?o ?g)
		(g1_carry ?o ?g)
	)
(:action do-split
	:parameters ()
	:precondition (and (unsplit ))
	:effect (and (not (unsplit )) (split ))
)
(:action mark-done-g0
	:parameters ()
	:precondition (and (split ) (g0_at ball5 roomb) (g0_at ball1 roomb))
	:effect (and (g0_done___ ))
)
(:action mark-done-g1
	:parameters ()
	:precondition (and (split ) (g1_at ball14 roomb) (g1_at ball5 roomb))
	:effect (and (g1_done___ ))
)
(:action gGLOBAL_move
	:parameters (?from ?to)
	:precondition (and (unsplit ) (g0_room ?from) (g1_room ?from) (g0_room ?to) (g1_room ?to) (g0_at-robby ?from) (g1_at-robby ?from))
	:effect (and (g0_at-robby ?to) (g1_at-robby ?to) (not (g0_at-robby ?from)) (not (g1_at-robby ?from)) (increase (total-cost ) 1))
)
(:action g0_move
	:parameters (?from ?to)
	:precondition (and (g0_room ?from) (g0_room ?to) (g0_at-robby ?from) (split ))
	:effect (and (g0_at-robby ?to) (not (g0_at-robby ?from)))
)
(:action g1_move
	:parameters (?from ?to)
	:precondition (and (g1_room ?from) (g1_room ?to) (g1_at-robby ?from) (split ) (g0_done___ ))
	:effect (and (g1_at-robby ?to) (not (g1_at-robby ?from)))
)
(:action gGLOBAL_pick
	:parameters (?obj ?room ?gripper)
	:precondition (and (unsplit ) (g0_ball ?obj) (g1_ball ?obj) (g0_room ?room) (g1_room ?room) (g0_gripper ?gripper) (g1_gripper ?gripper) (g0_at ?obj ?room) (g1_at ?obj ?room) (g0_at-robby ?room) (g1_at-robby ?room) (g0_free ?gripper) (g1_free ?gripper))
	:effect (and (g0_carry ?obj ?gripper) (g1_carry ?obj ?gripper) (not (g0_at ?obj ?room)) (not (g1_at ?obj ?room)) (not (g0_free ?gripper)) (not (g1_free ?gripper)) (increase (total-cost ) 1))
)
(:action g0_pick
	:parameters (?obj ?room ?gripper)
	:precondition (and (g0_ball ?obj) (g0_room ?room) (g0_gripper ?gripper) (g0_at ?obj ?room) (g0_at-robby ?room) (g0_free ?gripper) (split ))
	:effect (and (g0_carry ?obj ?gripper) (not (g0_at ?obj ?room)) (not (g0_free ?gripper)))
)
(:action g1_pick
	:parameters (?obj ?room ?gripper)
	:precondition (and (g1_ball ?obj) (g1_room ?room) (g1_gripper ?gripper) (g1_at ?obj ?room) (g1_at-robby ?room) (g1_free ?gripper) (split ) (g0_done___ ))
	:effect (and (g1_carry ?obj ?gripper) (not (g1_at ?obj ?room)) (not (g1_free ?gripper)))
)
(:action gGLOBAL_drop
	:parameters (?obj ?room ?gripper)
	:precondition (and (unsplit ) (g0_ball ?obj) (g1_ball ?obj) (g0_room ?room) (g1_room ?room) (g0_gripper ?gripper) (g1_gripper ?gripper) (g0_carry ?obj ?gripper) (g1_carry ?obj ?gripper) (g0_at-robby ?room) (g1_at-robby ?room))
	:effect (and (g0_at ?obj ?room) (g1_at ?obj ?room) (g0_free ?gripper) (g1_free ?gripper) (not (g0_carry ?obj ?gripper)) (not (g1_carry ?obj ?gripper)) (increase (total-cost ) 1))
)
(:action g0_drop
	:parameters (?obj ?room ?gripper)
	:precondition (and (g0_ball ?obj) (g0_room ?room) (g0_gripper ?gripper) (g0_carry ?obj ?gripper) (g0_at-robby ?room) (split ))
	:effect (and (g0_at ?obj ?room) (g0_free ?gripper) (not (g0_carry ?obj ?gripper)))
)
(:action g1_drop
	:parameters (?obj ?room ?gripper)
	:precondition (and (g1_ball ?obj) (g1_room ?room) (g1_gripper ?gripper) (g1_carry ?obj ?gripper) (g1_at-robby ?room) (split ) (g0_done___ ))
	:effect (and (g1_at ?obj ?room) (g1_free ?gripper) (not (g1_carry ?obj ?gripper)))
)
)

; problem
(define (problem strips-gripper-x-7)
	(:domain gripper-strips)
	(:objects rooma roomb ball16 ball15 ball14 ball13 ball12 ball11 ball10 ball9 ball8 ball7 ball6 ball5 ball4 ball3 ball2 ball1 left right)
	(:init 
		(unsplit )
		(g0_room rooma)
		(g1_room rooma)
		(g0_room roomb)
		(g1_room roomb)
		(g0_ball ball16)
		(g1_ball ball16)
		(g0_ball ball15)
		(g1_ball ball15)
		(g0_ball ball14)
		(g1_ball ball14)
		(g0_ball ball13)
		(g1_ball ball13)
		(g0_ball ball12)
		(g1_ball ball12)
		(g0_ball ball11)
		(g1_ball ball11)
		(g0_ball ball10)
		(g1_ball ball10)
		(g0_ball ball9)
		(g1_ball ball9)
		(g0_ball ball8)
		(g1_ball ball8)
		(g0_ball ball7)
		(g1_ball ball7)
		(g0_ball ball6)
		(g1_ball ball6)
		(g0_ball ball5)
		(g1_ball ball5)
		(g0_ball ball4)
		(g1_ball ball4)
		(g0_ball ball3)
		(g1_ball ball3)
		(g0_ball ball2)
		(g1_ball ball2)
		(g0_ball ball1)
		(g1_ball ball1)
		(g0_at-robby rooma)
		(g1_at-robby rooma)
		(g0_free left)
		(g1_free left)
		(g0_free right)
		(g1_free right)
		(g0_at ball16 rooma)
		(g1_at ball16 rooma)
		(g0_at ball15 rooma)
		(g1_at ball15 rooma)
		(g0_at ball14 rooma)
		(g1_at ball14 rooma)
		(g0_at ball13 rooma)
		(g1_at ball13 rooma)
		(g0_at ball12 rooma)
		(g1_at ball12 rooma)
		(g0_at ball11 rooma)
		(g1_at ball11 rooma)
		(g0_at ball10 rooma)
		(g1_at ball10 rooma)
		(g0_at ball9 rooma)
		(g1_at ball9 rooma)
		(g0_at ball8 rooma)
		(g1_at ball8 rooma)
		(g0_at ball7 rooma)
		(g1_at ball7 rooma)
		(g0_at ball6 rooma)
		(g1_at ball6 rooma)
		(g0_at ball5 rooma)
		(g1_at ball5 rooma)
		(g0_at ball4 rooma)
		(g1_at ball4 rooma)
		(g0_at ball3 rooma)
		(g1_at ball3 rooma)
		(g0_at ball2 rooma)
		(g1_at ball2 rooma)
		(g0_at ball1 rooma)
		(g1_at ball1 rooma)
		(g0_gripper left)
		(g1_gripper left)
		(g0_gripper right)
		(g1_gripper right)
	)
	(:goal (and (g0_at ball5 roomb) (g0_at ball1 roomb) (g1_at ball14 roomb) (g1_at ball5 roomb)))
)

; plan
1. (gglobal_pick ball1 rooma left)
   deleted: (g0_at ball1 rooma) (g1_at ball1 rooma) (g0_free left) (g1_free left)
   added: (g0_carry ball1 left) (g1_carry ball1 left)
   goals met: 0 of 4
2. (gglobal_pick ball14 rooma right)
   deleted: (g0_at ball14 rooma) (g1_at ball14 rooma) (g0_free right) (g1_free right)
   added: (g0_carry ball14 right) (g1_carry ball14 right)
   goals met: 0 of 4
3. (gglobal_move rooma roomb)
   deleted: (g0_at-robby rooma) (g1_at-robby rooma)
   added: (g0_at-robby roomb) (g1_at-robby roomb)
   goals met: 0 of 4
4. (gglobal_drop ball1 roomb left)
   deleted: (g0_carry ball1 left) (g1_carry ball1 left)
   added: (g0_at ball1 roomb) (g1_at ball1 roomb) (g0_free left) (g1_free left)
   goals met: 1 of 4
5. (gglobal_move roomb rooma)
   deleted: (g0_at-robby roomb) (g1_at-robby roomb)
   added: (g0_at-robby rooma) (g1_at-robby rooma)
   goals met: 1 of 4
6. (gglobal_pick ball5 rooma left)
   deleted: (g0_at ball5 rooma) (g1_at ball5 rooma) (g0_free left) (g1_free left)
   added: (g0_carry ball5 left) (g1_carry ball5 left)
   goals met: 1 of 4
7. (gglobal_move rooma roomb)
   deleted: (g0_at-robby rooma) (g1_at-robby rooma)
   added: (g0_at-robby roomb) (g1_at-robby roomb)
   goals met: 1 of 4
8. (gglobal_drop ball5 roomb left)
   deleted: (g0_carry ball5 left) (g1_carry ball5 left)
   added: (g0_at ball5 roomb) (g1_at ball5 roomb) (g0_free left) (g1_free left)
   goals met: 3 of 4
9. (gglobal_drop ball14 roomb right)
   deleted: (g0_carry ball14 right) (g1_carry ball14 right)
   added: (g0_at ball14 roomb) (g1_at ball14 roomb) (g0_free right) (g1_free right)
   goals met: 4 of 4
